{
  "name": "Dr. Hamid Sarbazi-Azad",
  "imageSrc": "/avatars/1.jpg",
  "description": "Hamid Sarbazi-Azad received his BSc in electrical and computer engineering from Shahid-Beheshti University, Tehran, Iran, in 1992, his MSc in computer engineering from Sharif University of Technology, Tehran, Iran, in 1994, and his Ph.D. in computing science from the University of Glasgow, Glasgow, UK, in 2002. He is currently professor of computer science and engineering at Sharif University of Technology and heads the HPC center at the School of Computer Science, Institute for Research in Fundamental Sciences (IPM), Tehran, Iran. His research interests include high-performance computer/memory architectures, NoCs and SoCs, parallel and distributed systems, performance modeling/evaluation, and storage systems, on which he has published about 400 refereed conference and journal papers. He received Khwarizmi International Award in 2006, TWAS Young Scientist Award in engineering sciences in 2007, and Sharif University Distinguished Researcher awards in 2004, 2007, 2008, 2010 and 2013. He is now an associate editor of IEEE Computer Architecture Letters, ACM Computing Surveys, Elsevier Computers and Electrical Engineering, and CSI Journal on Computer Science and Engineering.",
  "overview": "The High Performance Computing Architectures and Networks (HPCAN) research group was established by Professor H. Sarbazi-Azad in 2003. The group members are accommodated in the Department of Computer Engineering at Sharif University of Technology, and the IPM School of Computer Science. The main focus of the group includes a wide range of theoretical and algorithmic issues as well as practical and engineering issues in high performance and network-based computing systems. Current research areas include advanced computer architectures, multicore and many core systems, learning accelerators, memory systems, SoCs/NoCs, interconnection networks, complex networks.",
  "CVLink": "https://sharif.edu/~azad/"
}
